google-coral/coralmicro/arduino/boards.txt
coral_micro.name=coral_micro
coral_micro.build.core=arduino
coral_micro.build.crossprefix=arm-none-eabi-
coral_micro.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

coral_micro.build.variant=coral_micro
coral_micro.build.mcu=cortex-m7
coral_micro.build.fpu=fpv5-d16
coral_micro.build.float-abi=hard
coral_micro.build.extra_flags=
coral_micro.build.architecture=cortex-m7
coral_micro.build.board=coral_micro_FREERTOS
coral_micro.build.ldscript=linker_script.ld
coral_micro.lib.freertos="{build.variant.path}/libs/liblibs_arduino_bundled.a"
coral_micro.lib.freertos.arch.define=
coral_micro.lib.freertos.defines={build.variant.path}/defines.txt
coral_micro.lib.freertos.ldflags={build.variant.path}/ldflags.txt
coral_micro.lib.freertos.cflags={build.variant.path}/cflags.txt
coral_micro.lib.freertos.cxxflags={build.variant.path}/cxxflags.txt
coral_micro.lib.freertos.includes={build.variant.path}/includes.txt
coral_micro.lib.freertos.extra_ldflags=

coral_micro.bootloader.file={runtime.platform.path}/bootloaders/coral_micro/image.srec

coral_micro.upload.tool=flashtool
coral_micro.upload.protocol=
coral_micro.upload.pattern={cmd.path} --elfloader_path {bootloader.file} --build_dir . --ram --elf_path {build.path}/{build.project_name}.elf --strip --toolchain {build.compiler_path}
